package main

import "fmt"

/*
题目描述
公元前五世纪，我国古代数学家张丘建在《算经》一书中提出了“百鸡问题”：鸡翁一值钱五，鸡母一值钱三，鸡雏三值钱一。百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？

详细描述：

接口说明

原型：

int GetResult(vector &list)

输入参数：

        无

输出参数（指针指向的内存区域保证有效）：

    list  鸡翁、鸡母、鸡雏组合的列表

返回值：

     -1 失败

     0 成功

输入描述:
输入任何一个整数，即可运行程序。

输出描述:


示例1
输入
复制
1
输出
复制
0 25 75
4 18 78
8 11 81
12 4 84
*/
func main() {
	var m int
	for {
		if _, err := fmt.Scan(&m); err != nil {
			return
		}
		// x + y + z = 100
		// 5x + 3y + z/3 = 100
		// y = (100 - 7x) / 4
		// z = 75 + 3x/4
		for x := 0; x <= 20; x += 4 {
			y := (100 - 7*x) / 4
			z := 75 + 3*x/4
			if y > 0 && z > 0 && x+y+z == 100 {
				fmt.Println(x, y, z)
			}
		}
	}
}
